// Да се напише класа за матрица. Во класата се чуваат елементите од матрицата од тип float (матрица со максимална димензија [10]x[10]) и големината на матрицата (број на редици и колони). За оваа класа да се преоптоварат следните оператори:
//
// оператор + за собирање матрица со број
// оператор - за одземање на матрици
// оператор * за множење на матрици
// операторот >> за внесување на елементите на матрицата
// операторот << за печатење на елементите на матрицата
// Во главната функција да се креираат објекти A, B и C со подразбирливиот конструктор на класата Matrica. Од стандарден влез да се прочитаат нивните вредности. Да се отпечати вредноста на изразот A-(B*C)+2 на стандарден излез.
//
// Да се претпостави дека секогаш матриците ќе бидат квадратни со ист број на редици и колони.
//
// For example:
//
// Input	Result
// 4
// 4
// 2 3 -1 1
// 0 2 1 1
// 0 2 3 2
// 2 1 -1 1
//
// 4
// 4
// 1 0 -1 1
// 1 2 1 1
// 0 2 0 2
// 2 1 -1 0
//
// 4
// 4
// 2 0 0 0
// 0 2 0 0
// 0 0 1 0
// 0 0 -0 1
//
// Result:
// 2 5 2 2
// 0 0 2 2
// 2 0 5 2
// 0 1 2 3




#include <iostream>
using namespace std;


int main() {
    Matrica A, B, C;
    // Читање на трите матрици. Влезот треба да е во формат: n [елементи] n [елементи]...
    if (!(cin >> A >> B >> C)) return 0;

    Matrica D = B * C;
    Matrica R = A - D + 2;

    cout << R;
    return 0;
}